MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ64GS606/mcu.h
#define _IFS2_SPI2IF_POSITION                    0x00000001
#define _IFS2_SPI2IF_MASK                        0x00000002
#define _IFS2_SPI2IF_LENGTH                      0x00000001

#define _IFS2_C1RXIF_POSITION                    0x00000002
#define _IFS2_C1RXIF_MASK                        0x00000004
#define _IFS2_C1RXIF_LENGTH                      0x00000001

#define _IFS2_C1IF_POSITION                      0x00000003
#define _IFS2_C1IF_MASK                          0x00000008
#define _IFS2_C1IF_LENGTH                        0x00000001

#define _IFS2_DMA3IF_POSITION                    0x00000004
#define _IFS2_DMA3IF_MASK                        0x00000010
#define _IFS2_DMA3IF_LENGTH                      0x00000001

#define _IFS2_IC3IF_POSITION                     0x00000005
#define _IFS2_IC3IF_MASK                         0x00000020
#define _IFS2_IC3IF_LENGTH                       0x00000001

#define _IFS2_IC4IF_POSITION                     0x00000006
#define _IFS2_IC4IF_MASK                         0x00000040
#define _IFS2_IC4IF_LENGTH                       0x00000001

#define _IFS2_C1EIF_POSITION                     0x00000002
#define _IFS2_C1EIF_MASK                         0x00000004
#define _IFS2_C1EIF_LENGTH                       0x00000001

#define _IFS3_SI2C2IF_POSITION                   0x00000001
#define _IFS3_SI2C2IF_MASK                       0x00000002
#define _IFS3_SI2C2IF_LENGTH                     0x00000001

#define _IFS3_MI2C2IF_POSITION                   0x00000002
#define _IFS3_MI2C2IF_MASK                       0x00000004
#define _IFS3_MI2C2IF_LENGTH                     0x00000001

#define _IFS3_INT3IF_POSITION                    0x00000005
#define _IFS3_INT3IF_MASK                        0x00000020
#define _IFS3_INT3IF_LENGTH                      0x00000001

#define _IFS3_INT4IF_POSITION                    0x00000006
#define _IFS3_INT4IF_MASK                        0x00000040
#define _IFS3_INT4IF_LENGTH                      0x00000001

#define _IFS3_PSEMIF_POSITION                    0x00000009
#define _IFS3_PSEMIF_MASK                        0x00000200
#define _IFS3_PSEMIF_LENGTH                      0x00000001

#define _IFS3_QEI1IF_POSITION                    0x0000000A
#define _IFS3_QEI1IF_MASK                        0x00000400
#define _IFS3_QEI1IF_LENGTH                      0x00000001

#define _IFS4_U1EIF_POSITION                     0x00000001
#define _IFS4_U1EIF_MASK                         0x00000002
#define _IFS4_U1EIF_LENGTH                       0x00000001

#define _IFS4_U2EIF_POSITION                     0x00000002
#define _IFS4_U2EIF_MASK                         0x00000004
#define _IFS4_U2EIF_LENGTH                       0x00000001

#define _IFS4_C1TXIF_POSITION                    0x00000006
#define _IFS4_C1TXIF_MASK                        0x00000040
#define _IFS4_C1TXIF_LENGTH                      0x00000001

#define _IFS4_PSESMIF_POSITION                   0x00000009
#define _IFS4_PSESMIF_MASK                       0x00000200
#define _IFS4_PSESMIF_LENGTH                     0x00000001

#define _IFS4_QEI2IF_POSITION                    0x0000000B
#define _IFS4_QEI2IF_MASK                        0x00000800
#define _IFS4_QEI2IF_LENGTH                      0x00000001

#define _IFS5_ADCP12IF_POSITION                  0x0000000D
#define _IFS5_ADCP12IF_MASK                      0x00002000
#define _IFS5_ADCP12IF_LENGTH                    0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000E
#define _IFS5_PWM1IF_MASK                        0x00004000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000F
#define _IFS5_PWM2IF_MASK                        0x00008000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS6_PWM3IF_POSITION                    0x00000000
#define _IFS6_PWM3IF_MASK                        0x00000001
#define _IFS6_PWM3IF_LENGTH                      0x00000001

#define _IFS6_PWM4IF_POSITION                    0x00000001
#define _IFS6_PWM4IF_MASK                        0x00000002
#define _IFS6_PWM4IF_LENGTH                      0x00000001

#define _IFS6_PWM5IF_POSITION                    0x00000002
#define _IFS6_PWM5IF_MASK                        0x00000004
#define _IFS6_PWM5IF_LENGTH                      0x00000001

#define _IFS6_PWM6IF_POSITION                    0x00000003
#define _IFS6_PWM6IF_MASK                        0x00000008
#define _IFS6_PWM6IF_LENGTH                      0x00000001

#define _IFS6_AC2IF_POSITION                     0x00000007
#define _IFS6_AC2IF_MASK                         0x00000080
#define _IFS6_AC2IF_LENGTH                       0x00000001

#define _IFS6_AC3IF_POSITION                     0x00000008
#define _IFS6_AC3IF_MASK                         0x00000100
#define _IFS6_AC3IF_LENGTH                       0x00000001

#define _IFS6_AC4IF_POSITION                     0x00000009
#define _IFS6_AC4IF_MASK                         0x00000200
#define _IFS6_AC4IF_LENGTH                       0x00000001

#define _IFS6_ADCP0IF_POSITION                   0x0000000E
#define _IFS6_ADCP0IF_MASK                       0x00004000
#define _IFS6_ADCP0IF_LENGTH                     0x00000001

#define _IFS6_ADCP1IF_POSITION                   0x0000000F
#define _IFS6_ADCP1IF_MASK                       0x00008000
#define _IFS6_ADCP1IF_LENGTH                     0x00000001

#define _IFS7_ADCP2IF_POSITION                   0x00000000
#define _IFS7_ADCP2IF_MASK                       0x00000001
#define _IFS7_ADCP2IF_LENGTH                     0x00000001

#define _IFS7_ADCP3IF_POSITION                   0x00000001
#define _IFS7_ADCP3IF_MASK                       0x00000002
#define _IFS7_ADCP3IF_LENGTH                     0x00000001

#define _IFS7_ADCP4IF_POSITION                   0x00000002
#define _IFS7_ADCP4IF_MASK                       0x00000004
#define _IFS7_ADCP4IF_LENGTH                     0x00000001

#define _IFS7_ADCP5IF_POSITION                   0x00000003
#define _IFS7_ADCP5IF_MASK                       0x00000008
#define _IFS7_ADCP5IF_LENGTH                     0x00000001

